{
    "title": "Quentin Legot's Portfolio",
    "cv": {
        "section": {
            "experience": "Experience",
            "formation": "Formation",
            "skills": "Skills",
            "project": "Personal projects"
        },
        "experience": [
            {
                "title": "Full Stack Developer",
                "type": "Internship",
                "description": "Developer on a web and mobile GIS (Geographic Information System) application running on the AWS cloud (lambda, cloudformation, cognito, dynamo, etc.). This application has a learning vocation in order to train interns and work-study students in bluegreen, cloud and teamwork."
            },
            {
                "title": "QA automation tester",
                "type": "Internship",
                "description": "Automation intern: development of functional tests on an iOS and Android mobile application and implementation of a complete CI pipeline around this same project"
            },
            {
                "title": "IT Intern",
                "type": "Internship",
                "description": "My mission within GREYC consisted of developing tools for analyzing runners' performance on an orienteering course using GPS data obtained using a mobile application or a GPS watch."
            }
        ],
        "formation": [
            {
                "title": "IT Master",
                "description": "Cloud and network speciality"
            },
            {
                "title": "IT bachelor"
            }
        ],
        "skills": [
            {
                "title": "Java",
                "content": "One of my main language, I use it on a lot of projects. I regularly use Gradle and Maven for building projects."
            },
            {
                "title": "Javascript / Typescript",
                "content": "Being a big fan a hightly typed language, I like to use Typescript and I do not hesitate to replace Javascript with Typescript when possible. I use Javascript and Typescript on some project likeElectron, AWS lambda or Web front-ends"
            },
            {
                "title": "Python",
                "content": "I have used Python a lot during my studies, a lot, as well as its scientific and matrix librairies(numpy, scipy, matplotlib, etc.)"
            },
            {
                "title": "Rust",
                "content": "My favorite low-level language, unfortunaly, I only had little opportunity to use it but I would like to use it more in the future"
            },
            {
                "title": "Golang",
                "content": "I particularly like making golang APIs with gin thanks to its simplicity and speed, I use it in certain projects and automated deployments"
            },
            {
                "title": "SQL",
                "content": "I have long been familiar with relational database software such as MySQL, MariaDB and Postgresql"
            },
            {
                "title": "React",
                "content": "The front-end framework that I prefer, its simplicity of use and the readability of its instructions helping and facilitating code maintenance, this site was designed with it"
            },
            {
                "title": "Tailwind CSS",
                "content": "A CSS styling framework that goes well with front-end frameworks like React or Vue and is fun to handle, this site was designed with it"
            },
            {
                "title": "AWS",
                "content": "Currently training on AWS, I know many services essential for the proper functioning of a modern and scalable website"
            },
            {
                "title": "Dart and Flutter",
                "content": "A very powerful programming language and Framework to make mobile and computer native applications with one unique codebase."
            },
            {
                "title": "DevSecOps practices",
                "content": "I have experience with Git, Gitlab and GitHub, Gitlab CI, GitHub Actions, Docker, Docker Compose, Kubernetes, Ansible, AWS Cloudformation as well as networking knowledge"
            },
            {
                "title": "And more",
                "content": "I still have other knowledge that is not necessary to display here, but if you are interested in my profile, do not hesitate to contact me"
            }
        ],
        "projects": [
            {
                "name": "BurritOS",
                "languages": "Rust, C and RISC-V assembly",
                "link": "https://git.altarik.fr/quentinlegot/burritos",
                "year": 2023,
                "description": [
                    "BurritOS is an educational operating system written in Rust and running on a RISC-V instruction simulator.",
                    "It is capable of launching user programs written in C and compiled into elf binaries intended for the 64-bit RISC-V instruction set."
                ]
            }
        ]
    }
    

}